title: Potential Defense Evasion Activity Via Emoji Usage In CommandLine - 1
id: 4a30ac0c-b9d6-4e01-b71a-5f851bbf4259
status: test
description: '[Source: rules/process_creation/proc_creation_win_susp_emoji_usage_in_cli_1.yml]
  Detects the usage of emojis in the command line, this could be a sign of potential
  defense evasion activity.'
author: '@Kostastsale, TheDFIRReport'
references:
- Internal Research
tags:
- attack.defense-evasion
date: 2022-12-05
logsource:
  product: windows
  category: process_creation
detection:
  selection:
    CommandLine|contains:
    - 😀
    - 😃
    - 😄
    - 😁
    - 😆
    - 😅
    - 😂
    - 🤣
    - 🥲
    - 🥹
    - ☺️
    - 😊
    - 😇
    - 🙂
    - 🙃
    - 😉
    - 😌
    - 😍
    - 🥰
    - 😘
    - 😗
    - 😙
    - 😚
    - 😋
    - 😛
    - 😝
    - 😜
    - 🤪
    - 🤨
    - 🧐
    - 🤓
    - 😎
    - 🥸
    - 🤩
    - 🥳
    - 😏
    - 😒
    - 😞
    - 😔
    - 😟
    - 😕
    - 🙁
    - ☹️
    - 😣
    - 😖
    - 😫
    - 😩
    - 🥺
    - 😢
    - 😭
    - 😮‍💨
    - 😤
    - 😠
    - 😡
    - 🤬
    - 🤯
    - 😳
    - 🥵
    - 🥶
    - 😱
    - 😨
    - 😰
    - 😥
    - 😓
    - 🫣
    - 🤗
    - 🫡
    - 🤔
    - 🫢
    - 🤭
    - 🤫
    - 🤥
    - 😶
    - 😶‍🌫️
    - 😐
    - 😑
    - 😬
    - 🫠
    - 🙄
    - 😯
    - 😦
    - 😧
    - 😮
    - 😲
    - 🥱
    - 😴
    - 🤤
    - 😪
    - 😵
    - 😵‍💫
    - 🫥
    - 🤐
    - 🥴
    - 🤢
    - 🤮
    - 🤧
    - 😷
    - 🤒
    - 🤕
    - 🤑
    - 🤠
    - 😈
    - 👿
    - 👹
    - 👺
    - 🤡
    - 💩
    - 👻
    - 💀
    - ☠️
    - 👽
    - 👾
    - 🤖
    - 🎃
    - 😺
    - 😸
    - 😹
    - 😻
    - 😼
    - 😽
    - 🙀
    - 😿
    - 😾
    - 👋
    - 🤚
    - 🖐
    - ✋
    - 🖖
    - 👌
    - 🤌
    - 🤏
    - ✌️
    - 🤞
    - 🫰
    - 🤟
    - 🤘
    - 🤙
    - 🫵
    - 🫱
    - 🫲
    - 🫳
    - 🫴
    - 👈
    - 👉
    - 👆
    - 🖕
    - 👇
    - ☝️
    - 👍
    - 👎
    - ✊
    - 👊
    - 🤛
    - 🤜
    - 👏
    - 🫶
    - 🙌
    - 👐
    - 🤲
    - 🤝
    - 🙏
    - ✍️
    - 💪
    - 🦾
    - 🦵
    - 🦿
    - 🦶
    - 👣
    - 👂
    - 🦻
    - 👃
    - 🫀
    - 🫁
    - 🧠
    - 🦷
    - 🦴
    - 👀
    - 👁
    - 👅
    - 👄
    - 🫦
    - 💋
    - 🩸
    - 👶
    - 👧
    - 🧒
    - 👦
    - 👩
    - 🧑
    - 👨
    - 👩‍🦱
    - 🧑‍🦱
    - 👨‍🦱
    - 👩‍🦰
    - 🧑‍🦰
    - 👨‍🦰
    - 👱‍♀️
    - 👱
    - 👱‍♂️
    - 👩‍🦳
    - 🧑‍🦳
    - 👨‍🦳
    - 👩‍🦲
    - 🧑‍🦲
    - 👨‍🦲
    - 🧔‍♀️
    - 🧔
    - 🧔‍♂️
    - 👵
    - 🧓
    - 👴
    - 👲
    - 👳‍♀️
    - 👳
    - 👳‍♂️
    - 🧕
    - 👮‍♀️
    - 👮
    - 👮‍♂️
    - 👷‍♀️
    - 👷
    - 👷‍♂️
    - 💂‍♀️
    - 💂
    - 💂‍♂️
    - 🕵️‍♀️
    - 🕵️
    - 🕵️‍♂️
    - 👩‍⚕️
    - 🧑‍⚕️
    - 👨‍⚕️
    - 👩‍🌾
    - 🧑‍🌾
    - 👨‍🌾
    - 👩‍🍳
    - 🧑‍🍳
    - 👨‍🍳
    - 👩‍🎓
    - 🧑‍🎓
    - 👨‍🎓
    - 👩‍🎤
    - 🧑‍🎤
    - 👨‍🎤
    - 👩‍🏫
    - 🧑‍🏫
    - 👨‍🏫
    - 👩‍🏭
    - 🧑‍🏭
    - 👨‍🏭
    - 👩‍💻
    - 🧑‍💻
    - 👨‍💻
    - 👩‍💼
    - 🧑‍💼
    - 👨‍💼
    - 👩‍🔧
    - 🧑‍🔧
    - 👨‍🔧
    - 👩‍🔬
    - 🧑‍🔬
    - 👨‍🔬
    - 👩‍🎨
    - 🧑‍🎨
    - 👨‍🎨
    - 👩‍🚒
    - 🧑‍🚒
    - 👨‍🚒
    - 👩‍✈️
    - 🧑‍✈️
    - 👨‍✈️
    - 👩‍🚀
    - 🧑‍🚀
    - 👨‍🚀
    - 👩‍⚖️
    - 🧑‍⚖️
    - 👨‍⚖️
    - 👰‍♀️
    - 👰
    - 👰‍♂️
    - 🤵‍♀️
    - 🤵
    - 🤵‍♂️
    - 👸
    - 🫅
    - 🤴
    - 🥷
    - 🦸‍♀️
    - 🦸
    - 🦸‍♂️
    - 🦹‍♀️
    - 🦹
    - 🦹‍♂️
    - 🤶
    - 🧑‍🎄
    - 🎅
    - 🧙‍♀️
    - 🧙
    - 🧙‍♂️
    - 🧝‍♀️
    - 🧝
    - 🧝‍♂️
    - 🧛‍♀️
    - 🧛
    - 🧛‍♂️
    - 🧟‍♀️
    - 🧟
    - 🧟‍♂️
    - 🧞‍♀️
    - 🧞
    - 🧞‍♂️
    - 🧜‍♀️
    - 🧜
    - 🧜‍♂️
    - 🧚‍♀️
    - 🧚
    - 🧚‍♂️
    - 🧌
    - 👼
    - 🤰
    - 🫄
    - 🫃
    - 🤱
    - 👩‍🍼
    - 🧑‍🍼
    - 👨‍🍼
    - 🙇‍♀️
    - 🙇
    - 🙇‍♂️
    - 💁‍♀️
    - 💁
    - 💁‍♂️
    - 🙅‍♀️
    - 🙅
    - 🙅‍♂️
    - 🙆‍♀️
    - 🙆
    - 🙆‍♂️
    - 🙋‍♀️
    - 🙋
    - 🙋‍♂️
    - 🧏‍♀️
    - 🧏
    - 🧏‍♂️
    - 🤦‍♀️
    - 🤦
    - 🤦‍♂️
    - 🤷‍♀️
    - 🤷
    - 🤷‍♂️
    - 🙎‍♀️
    - 🙎
    - 🙎‍♂️
    - 🙍‍♀️
    - 🙍
    - 🙍‍♂️
    - 💇‍♀️
    - 💇
    - 💇‍♂️
    - 💆‍♀️
    - 💆
    - 💆‍♂️
    - 🧖‍♀️
    - 🧖
    - 🧖‍♂️
    - 💅
    - 💃
    - 🕺
    - 👯‍♀️
    - 👯
    - 👯‍♂️
    - 🕴
    - 👩‍🦽
    - 🧑‍🦽
    - 👨‍🦽
    - 👩‍🦼
    - 🧑‍🦼
    - 👨‍🦼
    - 🚶‍♀️
    - 🚶
    - 🚶‍♂️
    - 👩‍🦯
    - 🧑‍🦯
    - 👨‍🦯
    - 🧎‍♀️
    - 🧎
    - 🧎‍♂️
    - 🏃‍♀️
    - 🏃
    - 🏃‍♂️
    - 🧍‍♀️
    - 🧍
    - 🧍‍♂️
    - 👭
    - 🧑‍🤝‍🧑
    - 👬
    - 👫
    - 👩‍❤️‍👩
    - 💑
    - 👨‍❤️‍👨
    - 👩‍❤️‍👨
    - 👩‍❤️‍💋‍👩
    - 💏
    - 👨‍❤️‍💋‍👨
    - 👩‍❤️‍💋‍👨
    - 👪
    - 👨‍👩‍👦
    - 👨‍👩‍👧
    - 👨‍👩‍👧‍👦
    - 👨‍👩‍👦‍👦
    - 👨‍👩‍👧‍👧
    - 👨‍👨‍👦
    - 👨‍👨‍👧
    - 👨‍👨‍👧‍👦
    - 👨‍👨‍👦‍👦
    - 👨‍👨‍👧‍👧
    - 👩‍👩‍👦
    - 👩‍👩‍👧
    - 👩‍👩‍👧‍👦
    - 👩‍👩‍👦‍👦
    - 👩‍👩‍👧‍👧
    - 👨‍👦
    - 👨‍👦‍👦
    - 👨‍👧
    - 👨‍👧‍👦
    - 👨‍👧‍👧
    - 👩‍👦
    - 👩‍👦‍👦
    - 👩‍👧
    - 👩‍👧‍👦
    - 👩‍👧‍👧
    - 🗣
    - 👤
    - 👥
    - 🫂
    - 🧳
    - 🌂
    - ☂️
    - 🧵
    - 🪡
    - 🪢
    - 🧶
    - 👓
    - 🕶
    - 🥽
    - 🥼
    - 🦺
    - 👔
    - 👕
    - 👖
    - 🧣
    - 🧤
    - 🧥
    - 🧦
    - 👗
    - 👘
    - 🥻
    - 🩴
    - 🩱
    - 🩲
    - 🩳
    - 👙
    - 👚
    - 👛
    - 👜
    - 👝
    - 🎒
    - 👞
    - 👟
    - 🥾
    - 🥿
    - 👠
    - 👡
    - 🩰
    - 👢
    - 👑
    - 👒
    - 🎩
    - 🎓
    - 🧢
    - ⛑
    - 🪖
    - 💄
    - 💍
    - 💼
    - 👋🏻
    - 🤚🏻
    - 🖐🏻
    - ✋🏻
    - 🖖🏻
    - 👌🏻
    - 🤌🏻
    - 🤏🏻
    - ✌🏻
    - 🤞🏻
    - 🫰🏻
    - 🤟🏻
    - 🤘🏻
    - 🤙🏻
    - 🫵🏻
    - 🫱🏻
    - 🫲🏻
    - 🫳🏻
    - 🫴🏻
    - 👈🏻
    - 👉🏻
    - 👆🏻
    - 🖕🏻
    - 👇🏻
    - ☝🏻
    - 👍🏻
    - 👎🏻
    - ✊🏻
    - 👊🏻
    - 🤛🏻
    - 🤜🏻
    - 👏🏻
    - 🫶🏻
    - 🙌🏻
    - 👐🏻
    - 🤲🏻
    - 🙏🏻
    - ✍🏻
    - 💪🏻
    - 🦵🏻
    - 🦶🏻
    - 👂🏻
    - 🦻🏻
    - 👃🏻
    - 👶🏻
    - 👧🏻
    - 🧒🏻
    - 👦🏻
    - 👩🏻
    - 🧑🏻
    - 👨🏻
    - 👩🏻‍🦱
    - 🧑🏻‍🦱
    - 👨🏻‍🦱
    - 👩🏻‍🦰
    - 🧑🏻‍🦰
    - 👨🏻‍🦰
    - 👱🏻‍♀️
    - 👱🏻
    - 👱🏻‍♂️
    - 👩🏻‍🦳
    - 🧑🏻‍🦳
    - 👨🏻‍🦳
    - 👩🏻‍🦲
    - 🧑🏻‍🦲
    - 👨🏻‍🦲
    - 🧔🏻‍♀️
    - 🧔🏻
    - 🧔🏻‍♂️
    - 👵🏻
    - 🧓🏻
    - 👴🏻
    - 👲🏻
    - 👳🏻‍♀️
    - 👳🏻
    - 👳🏻‍♂️
    - 🧕🏻
    - 👮🏻‍♀️
    - 👮🏻
    - 👮🏻‍♂️
    - 👷🏻‍♀️
    - 👷🏻
    - 👷🏻‍♂️
    - 💂🏻‍♀️
    - 💂🏻
    - 💂🏻‍♂️
    - 🕵🏻‍♀️
    - 🕵🏻
    - 🕵🏻‍♂️
    - 👩🏻‍⚕️
    - 🧑🏻‍⚕️
    - 👨🏻‍⚕️
    - 👩🏻‍🌾
    - 🧑🏻‍🌾
    - 👨🏻‍🌾
    - 👩🏻‍🍳
    - 🧑🏻‍🍳
    - 👨🏻‍🍳
    - 👩🏻‍🎓
    - 🧑🏻‍🎓
    - 👨🏻‍🎓
    - 👩🏻‍🎤
    - 🧑🏻‍🎤
    - 👨🏻‍🎤
    - 👩🏻‍🏫
    - 🧑🏻‍🏫
    - 👨🏻‍🏫
    - 👩🏻‍🏭
    - 🧑🏻‍🏭
    - 👨🏻‍🏭
    - 👩🏻‍💻
    - 🧑🏻‍💻
    - 👨🏻‍💻
    - 👩🏻‍💼
    - 🧑🏻‍💼
    - 👨🏻‍💼
    - 👩🏻‍🔧
    - 🧑🏻‍🔧
    - 👨🏻‍🔧
    - 👩🏻‍🔬
    - 🧑🏻‍🔬
    - 👨🏻‍🔬
    - 👩🏻‍🎨
    - 🧑🏻‍🎨
    - 👨🏻‍🎨
    - 👩🏻‍🚒
    - 🧑🏻‍🚒
    - 👨🏻‍🚒
    - 👩🏻‍✈️
    - 🧑🏻‍✈️
    - 👨🏻‍✈️
    - 👩🏻‍🚀
    - 🧑🏻‍🚀
    - 👨🏻‍🚀
    - 👩🏻‍⚖️
    - 🧑🏻‍⚖️
    - 👨🏻‍⚖️
    - 👰🏻‍♀️
    - 👰🏻
    - 👰🏻‍♂️
    - 🤵🏻‍♀️
    - 🤵🏻
    - 🤵🏻‍♂️
    - 👸🏻
    - 🫅🏻
    - 🤴🏻
    - 🥷🏻
    - 🦸🏻‍♀️
    - 🦸🏻
    - 🦸🏻‍♂️
    - 🦹🏻‍♀️
    - 🦹🏻
    - 🦹🏻‍♂️
    - 🤶🏻
    - 🧑🏻‍🎄
    - 🎅🏻
    - 🧙🏻‍♀️
    - 🧙🏻
    - 🧙🏻‍♂️
    - 🧝🏻‍♀️
    - 🧝🏻
    - 🧝🏻‍♂️
    - 🧛🏻‍♀️
    - 🧛🏻
    - 🧛🏻‍♂️
    - 🧜🏻‍♀️
    - 🧜🏻
    - 🧜🏻‍♂️
    - 🧚🏻‍♀️
    - 🧚🏻
    - 🧚🏻‍♂️
    - 👼🏻
    - 🤰🏻
    - 🫄🏻
    - 🫃🏻
    - 🤱🏻
    - 👩🏻‍🍼
    - 🧑🏻‍🍼
    - 👨🏻‍🍼
    - 🙇🏻‍♀️
    - 🙇🏻
    - 🙇🏻‍♂️
    - 💁🏻‍♀️
    - 💁🏻
    - 💁🏻‍♂️
    - 🙅🏻‍♀️
    - 🙅🏻
    - 🙅🏻‍♂️
    - 🙆🏻‍♀️
    - 🙆🏻
    - 🙆🏻‍♂️
    - 🙋🏻‍♀️
    - 🙋🏻
    - 🙋🏻‍♂️
    - 🧏🏻‍♀️
    - 🧏🏻
    - 🧏🏻‍♂️
    - 🤦🏻‍♀️
    - 🤦🏻
    - 🤦🏻‍♂️
    - 🤷🏻‍♀️
    - 🤷🏻
    - 🤷🏻‍♂️
    - 🙎🏻‍♀️
    - 🙎🏻
    - 🙎🏻‍♂️
    - 🙍🏻‍♀️
    - 🙍🏻
    - 🙍🏻‍♂️
    - 💇🏻‍♀️
    - 💇🏻
    - 💇🏻‍♂️
    - 💆🏻‍♀️
    - 💆🏻
    - 💆🏻‍♂️
    - 🧖🏻‍♀️
    - 🧖🏻
    - 🧖🏻‍♂️
    - 💃🏻
    - 🕺🏻
    - 🕴🏻
    - 👩🏻‍🦽
    - 🧑🏻‍🦽
    - 👨🏻‍🦽
    - 👩🏻‍🦼
    - 🧑🏻‍🦼
    - 👨🏻‍🦼
    - 🚶🏻‍♀️
    - 🚶🏻
    - 🚶🏻‍♂️
    - 👩🏻‍🦯
    - 🧑🏻‍🦯
    - 👨🏻‍🦯
    - 🧎🏻‍♀️
    - 🧎🏻
    - 🧎🏻‍♂️
    - 🏃🏻‍♀️
    - 🏃🏻
    - 🏃🏻‍♂️
    - 🧍🏻‍♀️
    - 🧍🏻
    - 🧍🏻‍♂️
    - 👭🏻
    - 🧑🏻‍🤝‍🧑🏻
    - 👬🏻
    - 👫🏻
    - 🧗🏻‍♀️
    - 🧗🏻
    - 🧗🏻‍♂️
    - 🏇🏻
    - 🏂🏻
    - 🏌🏻‍♀️
    - 🏌🏻
    - 🏌🏻‍♂️
    - 🏄🏻‍♀️
    - 🏄🏻
    - 🏄🏻‍♂️
    - 🚣🏻‍♀️
    - 🚣🏻
    - 🚣🏻‍♂️
    - 🏊🏻‍♀️
    - 🏊🏻
    - 🏊🏻‍♂️
    - ⛹🏻‍♀️
    - ⛹🏻
    - ⛹🏻‍♂️
    - 🏋🏻‍♀️
    - 🏋🏻
    - 🏋🏻‍♂️
    - 🚴🏻‍♀️
    - 🚴🏻
    - 🚴🏻‍♂️
    - 🚵🏻‍♀️
    - 🚵🏻
    - 🚵🏻‍♂️
    - 🤸🏻‍♀️
    - 🤸🏻
    - 🤸🏻‍♂️
    - 🤽🏻‍♀️
    - 🤽🏻
    - 🤽🏻‍♂️
    - 🤾🏻‍♀️
    - 🤾🏻
    - 🤾🏻‍♂️
    - 🤹🏻‍♀️
    - 🤹🏻
    - 🤹🏻‍♂️
    - 🧘🏻‍♀️
    - 🧘🏻
    - 🧘🏻‍♂️
    - 🛀🏻
    - 🛌🏻
    - 👋🏼
    - 🤚🏼
    - 🖐🏼
    - ✋🏼
    - 🖖🏼
    - 👌🏼
    - 🤌🏼
    - 🤏🏼
    - ✌🏼
    - 🤞🏼
    - 🫰🏼
    - 🤟🏼
    - 🤘🏼
    - 🤙🏼
    - 🫵🏼
    - 🫱🏼
    - 🫲🏼
    - 🫳🏼
    - 🫴🏼
    - 👈🏼
    - 👉🏼
    - 👆🏼
    - 🖕🏼
    - 👇🏼
    - ☝🏼
    - 👍🏼
    - 👎🏼
    - ✊🏼
    - 👊🏼
    - 🤛🏼
    - 🤜🏼
    - 👏🏼
    - 🫶🏼
    - 🙌🏼
    - 👐🏼
    - 🤲🏼
    - 🙏🏼
    - ✍🏼
    - 💪🏼
    - 🦵🏼
    - 🦶🏼
    - 👂🏼
    - 🦻🏼
    - 👃🏼
    - 👶🏼
    - 👧🏼
    - 🧒🏼
    - 👦🏼
    - 👩🏼
    - 🧑🏼
    - 👨🏼
    - 👩🏼‍🦱
    - 🧑🏼‍🦱
    - 👨🏼‍🦱
    - 👩🏼‍🦰
    - 🧑🏼‍🦰
    - 👨🏼‍🦰
    - 👱🏼‍♀️
    - 👱🏼
    - 👱🏼‍♂️
    - 👩🏼‍🦳
    - 🧑🏼‍🦳
    - 👨🏼‍🦳
    - 👩🏼‍🦲
    - 🧑🏼‍🦲
    - 👨🏼‍🦲
    - 🧔🏼‍♀️
    - 🧔🏼
    - 🧔🏼‍♂️
    - 👵🏼
    - 🧓🏼
    - 👴🏼
    - 👲🏼
    - 👳🏼‍♀️
    - 👳🏼
    - 👳🏼‍♂️
    - 🧕🏼
    - 👮🏼‍♀️
    - 👮🏼
    - 👮🏼‍♂️
    - 👷🏼‍♀️
    - 👷🏼
    - 👷🏼‍♂️
    - 💂🏼‍♀️
    - 💂🏼
    - 💂🏼‍♂️
    - 🕵🏼‍♀️
    - 🕵🏼
    - 🕵🏼‍♂️
    - 👩🏼‍⚕️
    - 🧑🏼‍⚕️
    - 👨🏼‍⚕️
    - 👩🏼‍🌾
    - 🧑🏼‍🌾
    - 👨🏼‍🌾
    - 👩🏼‍🍳
    - 🧑🏼‍🍳
    - 👨🏼‍🍳
    - 👩🏼‍🎓
    - 🧑🏼‍🎓
    - 👨🏼‍🎓
    - 👩🏼‍🎤
    - 🧑🏼‍🎤
    - 👨🏼‍🎤
    - 👩🏼‍🏫
    - 🧑🏼‍🏫
    - 👨🏼‍🏫
    - 👩🏼‍🏭
    - 🧑🏼‍🏭
    - 👨🏼‍🏭
    - 👩🏼‍💻
    - 🧑🏼‍💻
    - 👨🏼‍💻
    - 👩🏼‍💼
    - 🧑🏼‍💼
    - 👨🏼‍💼
    - 👩🏼‍🔧
    - 🧑🏼‍🔧
    - 👨🏼‍🔧
    - 👩🏼‍🔬
    - 🧑🏼‍🔬
    - 👨🏼‍🔬
    - 👩🏼‍🎨
    - 🧑🏼‍🎨
    - 👨🏼‍🎨
    - 👩🏼‍🚒
    - 🧑🏼‍🚒
    - 👨🏼‍🚒
    - 👩🏼‍✈️
    - 🧑🏼‍✈️
    - 👨🏼‍✈️
    - 👩🏼‍🚀
    - 🧑🏼‍🚀
    - 👨🏼‍🚀
    - 👩🏼‍⚖️
    - 🧑🏼‍⚖️
    - 👨🏼‍⚖️
    - 👰🏼‍♀️
    - 👰🏼
    - 👰🏼‍♂️
    - 🤵🏼‍♀️
    - 🤵🏼
    - 🤵🏼‍♂️
    - 👸🏼
    - 🫅🏼
    - 🤴🏼
    - 🥷🏼
    - 🦸🏼‍♀️
    - 🦸🏼
    - 🦸🏼‍♂️
    - 🦹🏼‍♀️
    - 🦹🏼
    - 🦹🏼‍♂️
    - 🤶🏼
    - 🧑🏼‍🎄
    - 🎅🏼
    - 🧙🏼‍♀️
    - 🧙🏼
    - 🧙🏼‍♂️
    - 🧝🏼‍♀️
    - 🧝🏼
    - 🧝🏼‍♂️
    - 🧛🏼‍♀️
    - 🧛🏼
    - 🧛🏼‍♂️
    - 🧜🏼‍♀️
    - 🧜🏼
    - 🧜🏼‍♂️
    - 🧚🏼‍♀️
    - 🧚🏼
    - 🧚🏼‍♂️
    - 👼🏼
    - 🤰🏼
    - 🫄🏼
    - 🫃🏼
    - 🤱🏼
    - 👩🏼‍🍼
    - 🧑🏼‍🍼
    - 👨🏼‍🍼
    - 🙇🏼‍♀️
    - 🙇🏼
    - 🙇🏼‍♂️
    - 💁🏼‍♀️
    - 💁🏼
    - 💁🏼‍♂️
    - 🙅🏼‍♀️
    - 🙅🏼
    - 🙅🏼‍♂️
    - 🙆🏼‍♀️
    - 🙆🏼
    - 🙆🏼‍♂️
    - 🙋🏼‍♀️
    - 🙋🏼
    - 🙋🏼‍♂️
    - 🧏🏼‍♀️
    - 🧏🏼
    - 🧏🏼‍♂️
    - 🤦🏼‍♀️
    - 🤦🏼
    - 🤦🏼‍♂️
    - 🤷🏼‍♀️
  condition: selection
falsepositives:
- Unknown
level: high
