title: Powershell Token Obfuscation - Process Creation
id: deb9b646-a508-44ee-b7c9-d8965921c6b6
related:
- id: f3a98ce4-6164-4dd4-867c-4d83de7eca51
  type: similar
status: test
description: '[Source: rules/process_creation/proc_creation_win_powershell_token_obfuscation.yml]
  Detects TOKEN OBFUSCATION technique from Invoke-Obfuscation'
references:
- https://github.com/danielbohannon/Invoke-Obfuscation
author: frack113
date: 2022-12-27
modified: 2024-08-11
tags:
- attack.defense-evasion
- attack.t1027.009
logsource:
  category: process_creation
  product: windows
detection:
  selection:
  - CommandLine|re: \w+`(\w+|-|.)`[\w+|\s]
  - CommandLine|re: '"(\{\d\})+"\s*-f'
  - CommandLine|re: (?i)\$\{`?e`?n`?v`?:`?p`?a`?t`?h`?\}
  filter_main_envpath:
    CommandLine|contains: ${env:path}
  condition: selection and not 1 of filter_main_*
falsepositives:
- Unknown
level: high
