title: Use Of The SFTP.EXE Binary As A LOLBIN
id: a85ffc3a-e8fd-4040-93bf-78aff284d801
status: test
description: '[Source: rules/process_creation/proc_creation_win_lolbin_sftp.yml] Detects
  the usage of the "sftp.exe" binary as a LOLBIN by abusing the "-D" flag'
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/264
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-11-10
tags:
- attack.defense-evasion
- attack.execution
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \sftp.exe
    CommandLine|contains:
    - ' -D ..'
    - ' -D C:\'
  condition: selection
falsepositives:
- Unknown
level: medium
