title: Potentially Suspicious Child Processes Spawned by ConHost
id: dfa03a09-8b92-4d83-8e74-f72839b1c407
related:
- id: 7dc2dedd-7603-461a-bc13-15803d132355
  type: similar
status: experimental
description: '[Source: rules/process_creation/proc_creation_win_conhost_susp_winshell_child_process.yml]
  Detects suspicious child processes related to Windows Shell utilities spawned by
  `conhost.exe`, which could indicate malicious activity using trusted system components.'
references:
- https://tria.ge/241015-l98snsyeje/behavioral2
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-02-05
tags:
- attack.t1202
- attack.defense-evasion
- attack.t1218
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|endswith: \conhost.exe
  selection_child:
  - Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \wscript.exe
  - OriginalFileName:
    - cmd.exe
    - cscript.exe
    - mshta.exe
    - powershell_ise.exe
    - powershell.exe
    - pwsh.dll
    - regsvr32.exe
    - wscript.exe
  condition: all of selection_*
falsepositives:
- Legitimate administrative tasks using `conhost.exe` to spawn child processes such
  as `cmd.exe`, `powershell.exe`, or `regsvr32.exe`.
level: high
