title: HackTool - RemoteKrbRelay Execution
id: a7664b14-75fb-4a50-a223-cb9bc0afbacf
status: test
description: '[Source: rules/process_creation/proc_creation_win_hktl_krbrelay_remote.yml]
  Detects the use of RemoteKrbRelay, a Kerberos relaying tool via CommandLine flags
  and PE metadata.'
references:
- https://github.com/CICADA8-Research/RemoteKrbRelay
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-06-27
tags:
- attack.credential-access
- attack.t1558.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \RemoteKrbRelay.exe
  - OriginalFileName: RemoteKrbRelay.exe
  selection_cli_required:
    CommandLine|contains|all:
    - ' -clsid '
    - ' -target '
    - ' -victim '
  selection_cli_attack_smb:
    CommandLine|contains|all:
    - '-smb '
    - '--smbkeyword '
    CommandLine|contains:
    - interactive
    - secrets
    - service-add
  selection_cli_attack_rbcd_main:
    CommandLine|contains: '-rbcd '
  selection_cli_attack_rbcd_options:
    CommandLine|contains:
    - '-cn '
    - '--computername '
  selection_cli_attack_changepass:
    CommandLine|contains: '-chp '
    CommandLine|contains|all:
    - '-chpPass '
    - '-chpUser '
  selection_cli_attack_addgrpname:
    CommandLine|contains|all:
    - '-addgroupmember '
    - '-group '
    - '-groupuser '
  condition: selection_img or selection_cli_required or all of selection_cli_attack_rbcd_*
    or selection_cli_attack_changepass or selection_cli_attack_addgrpname or selection_cli_attack_smb
falsepositives:
- Unlikely
level: high
