title: Suspicious Scheduled Task Name As GUID
id: ff2fff64-4cd6-4a2b-ba7d-e28a30bbe66b
status: test
description: '[Source: rules/process_creation/proc_creation_win_schtasks_guid_task_name.yml]
  Detects creation of a scheduled task with a GUID like name'
references:
- https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-31
tags:
- attack.privilege-escalation
- attack.persistence
- attack.execution
- attack.t1053.005
logsource:
  product: windows
  category: process_creation
detection:
  selection_img:
    Image|endswith: \schtasks.exe
    CommandLine|contains: '/Create '
  selection_tn:
    CommandLine|contains:
    - /TN "{
    - /TN '{
    - /TN {
  selection_end:
    CommandLine|contains:
    - '}"'
    - '}'''
    - '} '
  condition: all of selection_*
falsepositives:
- Legitimate software naming their tasks as GUIDs
level: medium
