title: UAC Bypass Using Disk Cleanup
id: b697e69c-746f-4a86-9f59-7bfff8eab881
status: test
description: '[Source: rules/process_creation/proc_creation_win_uac_bypass_cleanmgr.yml]
  Detects the pattern of UAC Bypass using scheduled tasks and variable expansion of
  cleanmgr.exe (UACMe 34)'
references:
- https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2024-12-01
tags:
- attack.defense-evasion
- attack.privilege-escalation
- attack.t1548.002
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|endswith: '"\system32\cleanmgr.exe /autoclean /d C:'
    ParentCommandLine: C:\Windows\system32\svchost.exe -k netsvcs -p -s Schedule
    IntegrityLevel:
    - High
    - System
    - S-1-16-16384
    - S-1-16-12288
  condition: selection
falsepositives:
- Unknown
level: high
