title: Firewall Rule Update Via Netsh.EXE
id: a70dcb37-3bee-453a-99df-d0c683151be6
status: test
description: '[Source: rules/process_creation/proc_creation_win_netsh_fw_set_rule.yml]
  Detects execution of netsh with the "advfirewall" and the "set" option in order
  to set new values for properties of a existing rule'
references:
- https://ss64.com/nt/netsh.html
author: X__Junior (Nextron Systems)
date: 2023-07-18
tags:
- attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
  selection_cli:
    CommandLine|contains|all:
    - ' firewall '
    - ' set '
  condition: all of selection_*
falsepositives:
- Legitimate administration activity
- Software installations and removal
level: medium
