title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION
id: e9f55347-2928-4c06-88e5-1a7f8169942e
status: test
description: '[Source: rules/process_creation/proc_creation_win_hktl_invoke_obfuscation_via_var.yml]
  Detects Obfuscated Powershell via VAR++ LAUNCHER'
references:
- https://github.com/SigmaHQ/sigma/issues/1009
author: Timur Zinniatullin, oscd.community
date: 2020-10-13
modified: 2022-11-16
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - '&&set'
    - cmd
    - /c
    - -f
    CommandLine|contains:
    - '{0}'
    - '{1}'
    - '{2}'
    - '{3}'
    - '{4}'
    - '{5}'
  condition: selection
falsepositives:
- Unknown
level: high
