title: PUA - NSudo Execution
id: 771d1eb5-9587-4568-95fb-9ec44153a012
status: test
description: '[Source: rules/process_creation/proc_creation_win_pua_nsudo.yml] Detects
  the use of NSudo tool for command execution'
references:
- https://web.archive.org/web/20221019044836/https://nsudo.m2team.org/en-us/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali
date: 2022-01-24
modified: 2023-02-13
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith:
    - \NSudo.exe
    - \NSudoLC.exe
    - \NSudoLG.exe
  - OriginalFileName:
    - NSudo.exe
    - NSudoLC.exe
    - NSudoLG.exe
  selection_cli:
    CommandLine|contains:
    - '-U:S '
    - '-U:T '
    - '-U:E '
    - '-P:E '
    - '-M:S '
    - '-M:H '
    - '-U=S '
    - '-U=T '
    - '-U=E '
    - '-P=E '
    - '-M=S '
    - '-M=H '
    - -ShowWindowMode:Hide
  condition: all of selection_*
falsepositives:
- Legitimate use by administrators
level: high
