title: Password Set to Never Expire via WMI
id: 7864a175-3654-4824-9f0d-f0da18ab27c0
status: experimental
description: '[Source: rules/process_creation/proc_creation_win_wmi_password_never_expire.yml]
  Detects the use of wmic.exe to modify user account settings and explicitly disable
  password expiration.'
references:
- https://www.huntress.com/blog/the-unwanted-guest
author: Daniel Koifman (KoifSec)
date: 2025-07-30
tags:
- attack.privilege-escalation
- attack.execution
- attack.persistence
- attack.t1047
- attack.t1098
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
  selection_cli:
    CommandLine|contains|all:
    - useraccount
    - ' set '
    - passwordexpires
    - 'false'
  condition: all of selection_*
falsepositives:
- Legitimate administrative activity
level: medium
