title: Invoke-Obfuscation VAR+ Launcher
id: 27aec9c9-dbb0-4939-8422-1742242471d0
status: test
description: '[Source: rules/process_creation/proc_creation_win_hktl_invoke_obfuscation_var.yml]
  Detects Obfuscated use of Environment Variables to execute PowerShell'
references:
- https://github.com/SigmaHQ/sigma/issues/1009
author: Jonathan Cheong, oscd.community
date: 2020-10-15
modified: 2024-04-15
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: cmd.{0,5}(?:/c|/r)(?:\s|)\"set\s[a-zA-Z]{3,6}.*(?:\{\d\}){1,}\\\"\s+?\-f(?:.*\)){1,}.*\"
  condition: selection
falsepositives:
- Unknown
level: high
