title: Suspicious Windows Update Agent Empty Cmdline
id: 52d097e2-063e-4c9c-8fbb-855c8948d135
status: test
description: '[Source: rules/process_creation/proc_creation_win_wuauclt_no_cli_flags_execution.yml]
  Detects suspicious Windows Update Agent activity in which a wuauclt.exe process
  command line doesn''t contain any command line flags'
references:
- https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022-02-26
modified: 2023-11-11
tags:
- attack.defense-evasion
- attack.t1036
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \Wuauclt.exe
  - OriginalFileName: Wuauclt.exe
  selection_cli:
    CommandLine|endswith:
    - Wuauclt
    - Wuauclt.exe
  condition: all of selection*
falsepositives:
- Unknown
level: high
