title: Potential Privilege Escalation To LOCAL SYSTEM
id: 207b0396-3689-42d9-8399-4222658efc99
related:
- id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
  type: similar
status: test
description: '[Source: rules/process_creation/proc_creation_win_sysinternals_susp_psexec_paexec_flags.yml]
  Detects unknown program using commandline flags usually used by tools such as PsExec
  and PAExec to start programs with SYSTEM Privileges'
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2021-05-22
modified: 2024-03-05
tags:
- attack.resource-development
- attack.t1587.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|windash:
    - ' -s cmd'
    - ' -s -i cmd'
    - ' -i -s cmd'
    - ' -s pwsh'
    - ' -s -i pwsh'
    - ' -i -s pwsh'
    - ' -s powershell'
    - ' -s -i powershell'
    - ' -i -s powershell'
  filter_main_exclude_coverage:
    CommandLine|contains:
    - paexec
    - PsExec
    - accepteula
  condition: selection and not 1 of filter_main_*
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PsExec/PAExec with their software and rename it,
  so that it is less embarrassing
level: high
