title: Potential Obfuscated Ordinal Call Via Rundll32
id: 43fa5350-db63-4b8f-9a01-789a427074e1
status: test
description: '[Source: rules/process_creation/proc_creation_win_rundll32_obfuscated_ordinal_call.yml]
  Detects execution of "rundll32" with potential obfuscated ordinal calls'
references:
- Internal Research
- https://www.youtube.com/watch?v=52tAmVLg1KM&t=2070s
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron
  Systems)
date: 2023-05-17
modified: 2025-02-23
tags:
- attack.defense-evasion
- attack.t1027.010
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  - CommandLine|contains: rundll32
  selection_cli:
    CommandLine|contains:
    - '#+'
    - '#-'
    - '#0'
    - '#655'
    - '#656'
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
