title: New Virtual Smart Card Created Via TpmVscMgr.EXE
id: c633622e-cab9-4eaa-bb13-66a1d68b3e47
status: test
description: '[Source: rules/process_creation/proc_creation_win_tpmvscmgr_add_virtual_smartcard.yml]
  Detects execution of "Tpmvscmgr.exe" to create a new virtual smart card.'
references:
- https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-15
tags:
- attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
    Image|endswith: \tpmvscmgr.exe
    OriginalFileName: TpmVscMgr.exe
  selection_cli:
    CommandLine|contains: create
  condition: all of selection_*
falsepositives:
- Legitimate usage by an administrator
level: medium
