title: Potentially Suspicious Ping/Copy Command Combination
id: ded2b07a-d12f-4284-9b76-653e37b6c8b0
status: test
description: '[Source: rules/process_creation/proc_creation_win_cmd_ping_copy_combined_execution.yml]
  Detects uncommon and potentially suspicious one-liner command containing both "ping"
  and "copy" at the same time, which is usually used by malware.'
references:
- Internal Research
author: X__Junior (Nextron Systems)
date: 2023-07-18
modified: 2024-03-06
tags:
- attack.defense-evasion
- attack.t1070.004
logsource:
  category: process_creation
  product: windows
detection:
  selection_cmd:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
  selection_action:
    CommandLine|contains|all:
    - ping
    - 'copy '
  selection_cli_1:
    CommandLine|contains|windash: ' -n '
  selection_cli_2:
    CommandLine|contains|windash: ' -y '
  condition: all of selection_*
falsepositives:
- Unknown
level: medium
