title: Suspicious Usage Of Active Directory Diagnostic Tool (ntdsutil.exe)
id: a58353df-af43-4753-bad0-cd83ef35eef5
related:
- id: 2afafd61-6aae-4df4-baed-139fa1f4c345
  type: derived
status: test
description: '[Source: rules/process_creation/proc_creation_win_ntdsutil_susp_usage.yml]
  Detects execution of ntdsutil.exe to perform different actions such as restoring
  snapshots...etc.'
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731620(v=ws.11)
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/espionage-asia-governments
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-14
tags:
- attack.credential-access
- attack.t1003.003
logsource:
  category: process_creation
  product: windows
detection:
  selection_img:
  - Image|endswith: \ntdsutil.exe
  - OriginalFileName: ntdsutil.exe
  selection_cli:
  - CommandLine|contains|all:
    - snapshot
    - 'mount '
  - CommandLine|contains|all:
    - ac
    - ' i'
    - ' ntds'
  condition: all of selection_*
falsepositives:
- Legitimate usage to restore snapshots
- Legitimate admin activity
level: medium
