title: Invoke-Obfuscation CLIP+ Launcher
id: b222df08-0e07-11eb-adc1-0242ac120002
status: test
description: '[Source: rules/process_creation/proc_creation_win_hktl_invoke_obfuscation_clip.yml]
  Detects Obfuscated use of Clip.exe to execute PowerShell'
references:
- https://github.com/SigmaHQ/sigma/issues/1009
author: Jonathan Cheong, oscd.community
date: 2020-10-13
modified: 2022-11-17
tags:
- attack.defense-evasion
- attack.t1027
- attack.execution
- attack.t1059.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains|all:
    - cmd
    - '&&'
    - 'clipboard]::'
    - -f
    CommandLine|contains:
    - /c
    - /r
  condition: selection
falsepositives:
- Unknown
level: high
