title: Suspicious PowerShell In Registry Run Keys
id: 8d85cf08-bf97-4260-ba49-986a2a65129c
status: test
description: Phát hiện hành vi chèn lệnh PowerShell vào Registry Run keys để Persistence
author: Huy Trung
date: 2022-03-17
modified: 2026-04-06
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    selection:
        registry.path|contains:
            - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Run'
            - '\SOFTWARE\WOW6432Node\Microsoft\Windows\CurrentVersion\Run'
            - '\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
        
        # Thay Details bằng registry.data.strings (nơi chứa payload thực tế trong log ELK)
        registry.data.strings|contains:
            - 'powershell'
            - 'pwsh'
            - '-w '
            - 'hidden'
            - '-ep'
            - 'bypass'
            - '-nop'
            - 'iex'
            - 'Invoke-'
            - 'iwr'
            - 'FromBase64String'
            - '-enc'
    condition: selection
falsepositives:
    - Các script quản trị hệ thống hợp lệ (hiếm khi dùng Run key cho PowerShell ẩn).
level: high